In [153]:
import pandas as pd
import datetime

In [154]:
input = '_SP_m13_clsc_sdat.csv'
output = 'out' + input

In [155]:
aa = pd.read_csv('../_reports/' + input)
bb = aa.iloc[:,1]
cc = bb[bb.str[:12] == 'timestamp ts']
aa['timestamp'] = cc.str[10:25]
dd = pd.to_datetime(cc.str[13:25], format='%Y%m%d%H%M')
aa['ts'] = dd
ee = aa.sort_values(by='ts')

ee.to_csv('../_reports/' + output)

In [156]:
ee[(ee['ts'] == ee['ts'].max()) | (ee['ts'] == ee['ts'].min())]

,--------------------------------------------------------------------------------,Unnamed: 1,timestamp,ts
1,NaN,timestamp ts_200304030405 completed at 2022-10...,ts_200304030405,2003-04-03 04:05:00
3,NaN,timestamp ts_200304030405 completed at 2022-10...,ts_200304030405,2003-04-03 04:05:00

In [220]:
input = '_SP_m27_spl_sdat.csv'
output = 'out' + input

In [221]:
aa = pd.read_csv('../_reports/' + input)
bb = aa.iloc[:,1]
cc = bb[bb.str[:12] == 'timestamp ts']
aa['timestamp'] = cc.str[10:25]
dd = pd.to_datetime(cc.str[13:25], format='%Y%m%d%H%M')
aa['ts'] = dd
ee = aa.sort_values(by='ts')

ee.to_csv('../_reports/' + output)

In [162]:
ee[(ee['ts'] == ee['ts'].max()) | (ee['ts'] == ee['ts'].min())]

,--------------------------------------------------------------------------------,Unnamed: 1,timestamp,ts
1,NaN,timestamp ts_199809090740 completed at 2022-10...,ts_199809090740,1998-09-09 07:40:00
401,NaN,timestamp ts_199809112120 completed at 2022-10...,ts_199809112120,1998-09-11 21:20:00

In [59]:
aa = pd.read_csv('../' + input)
aa.head()

,--------------------------------------------------------------------------------,Unnamed: 1
0,starting ts_199809090740 at 2022-10-15 01:13:3...,NaN
1,NaN,timestamp ts_199809090740 completed at 2022-10...
2,NaN,elapsed time 0:06:54.448738
3,NaN,timestamp ts_199809090745 completed at 2022-10...
4,NaN,elapsed time 0:04:25.728494

In [60]:
bb = aa.iloc[:,1]
bb.head()

0                                                  NaN
1    timestamp ts_199809090740 completed at 2022-10...
2                          elapsed time 0:06:54.448738
3    timestamp ts_199809090745 completed at 2022-10...
4                          elapsed time 0:04:25.728494
Name: Unnamed: 1, dtype: object

In [61]:
cc = bb[bb.str[:12] == 'timestamp ts']
cc.head()

1    timestamp ts_199809090740 completed at 2022-10...
3    timestamp ts_199809090745 completed at 2022-10...
5    timestamp ts_199809090750 completed at 2022-10...
7    timestamp ts_199809090755 completed at 2022-10...
9    timestamp ts_199809090800 completed at 2022-10...
Name: Unnamed: 1, dtype: object

In [62]:
aa['timestamp'] = cc.str[10:25]
aa.head()

,--------------------------------------------------------------------------------,Unnamed: 1,timestamp
0,starting ts_199809090740 at 2022-10-15 01:13:3...,NaN,NaN
1,NaN,timestamp ts_199809090740 completed at 2022-10...,ts_199809090740
2,NaN,elapsed time 0:06:54.448738,NaN
3,NaN,timestamp ts_199809090745 completed at 2022-10...,ts_199809090745
4,NaN,elapsed time 0:04:25.728494,NaN

In [66]:
dd = pd.to_datetime(cc.str[13:25], format='%Y%m%d%H%M')
dd.head()

1   1998-09-09 07:40:00
3   1998-09-09 07:45:00
5   1998-09-09 07:50:00
7   1998-09-09 07:55:00
9   1998-09-09 08:00:00
Name: Unnamed: 1, dtype: datetime64[ns]

In [68]:
aa['ts'] = dd
aa.head()

,--------------------------------------------------------------------------------,Unnamed: 1,timestamp,ts
0,starting ts_199809090740 at 2022-10-15 01:13:3...,NaN,NaN,NaT
1,NaN,timestamp ts_199809090740 completed at 2022-10...,ts_199809090740,1998-09-09 07:40:00
2,NaN,elapsed time 0:06:54.448738,NaN,NaT
3,NaN,timestamp ts_199809090745 completed at 2022-10...,ts_199809090745,1998-09-09 07:45:00
4,NaN,elapsed time 0:04:25.728494,NaN,NaT

In [71]:
ee = aa.sort_values(by='ts')
ee.head()

,--------------------------------------------------------------------------------,Unnamed: 1,timestamp,ts
1,NaN,timestamp ts_199809090740 completed at 2022-10...,ts_199809090740,1998-09-09 07:40:00
111,NaN,timestamp ts_199809090740 completed at 2022-10...,ts_199809090740,1998-09-09 07:40:00
3,NaN,timestamp ts_199809090745 completed at 2022-10...,ts_199809090745,1998-09-09 07:45:00
113,NaN,timestamp ts_199809090745 completed at 2022-10...,ts_199809090745,1998-09-09 07:45:00
5,NaN,timestamp ts_199809090750 completed at 2022-10...,ts_199809090750,1998-09-09 07:50:00

In [72]:
ee.to_csv('../' + output)

In [148]:
x = 1500
print('{:04d}'.format(x))

1500